---
kind: type
id: T:Autodesk.Revit.DB.FabricationPart
source: html/c9b86162-c105-696a-a919-49a7a7938cc4.htm
---
# Autodesk.Revit.DB.FabricationPart

Represents a fabrication component in the Autodesk Revit MEP product.

## Syntax (C#)
```csharp
public class FabricationPart : Element
```